{"id":1328,"date":"2023-11-02T08:00:45","date_gmt":"2023-11-02T08:00:45","guid":{"rendered":"https:\/\/elementisboilerexperts.com\/?p=1328"},"modified":"2023-11-02T08:00:45","modified_gmt":"2023-11-02T08:00:45","slug":"boiler-mate-to-unvented-cylinder-conversion","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/case-studies\/boiler-mate-to-unvented-cylinder-conversion\/","title":{"rendered":"Boiler mate to unvented cylinder conversion"},"content":{"rendered":"<p>We were contacted by Henry in Wivenhoe regarding changing his old non condensing boiler and his boiler mate 2000 system. Apparently his boiler mate was the last one left on the estate as every other one had leaked through the ceiling, something that had happened here but had been repaired in the past.<\/p>\n<p><img decoding=\"async\" class=\"alignnone size-laptop-1200 wp-image-1334\" src=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/gledhill-boiler-mate-1024x1365.jpg\" alt=\"gledhill boiler mate\" width=\"1024\" height=\"1365\" srcset=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/gledhill-boiler-mate-1024x1365.jpg 1024w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/gledhill-boiler-mate-480x640.jpg 480w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/gledhill-boiler-mate-992x1323.jpg 992w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/gledhill-boiler-mate.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<h2>So what is a boiler mate and how does it work?<\/h2>\n<p>So where an unvented cylinder is filled with the water that comes out of your taps a boiler mate is filled with central heating water and a separate heat exchanger like a combi boiler heats the mains water for your taps instantly. The issue with this is when it was first installed or if any work has been carried out I can guarantee not enough inhibitor has been added to the system as usually only enough is needed for the radiators and pipework but with this type of system you need enough inhibitor for a huge cylinder of heating water.<\/p>\n<p>The lack of inhibitor causes blockages and corrosion throughout the heating system. There is another issue with this system and that is there are 3 pumps when a traditional system only has 1, this is just more things to fail and if the circuit board goes they're expensive. Gledhill used to offer a fixed price repair but not in Essex anymore. The best thing do with this system is rip it out and put a normal unvented cylinder in like we have.<\/p>\n<h2>Benefits of an unvented cylinder, condensing boiler and smart controls<\/h2>\n<h3>Unvented cylinder<\/h3>\n<p>The great thing about unvented cylinders is you have good water pressure from all of your taps (presuming the correct pressure and flow tests have been done on the property prior to the installation)<\/p>\n<p>You have a back up supply of hot water if there is a fault on the boiler, presuming you have a electrical spur and connection to the immersion heater.<\/p>\n<p>You can have a constant supply of hot water, they come in all shapes and sized to suit the property and the needs of the property as with a vented cylinder they're quite limited in their size. I personally run my unvented cylinder on continuous so whenever hot water is used the boiler will quickly heat the cylinder up.<\/p>\n<p>Unvented cylinders are very well insulated so lose very little heat so keeping them heating on a continuous program is the same price as heating it on a timer and you have the added benefit of always having enough hot water.<\/p>\n<h3>Condensing gas boiler<\/h3>\n<p>A condensing boiler saves a lot of money on your gas bills compared to a non-condensing boiler, the main way it does this is by reusing the flue heat. Instead of throwing all of the latent heat into the air it uses the heat to heat the return pipework inside the boiler. To prove the point i've tried putting my hand near the flue of a non-condensing boiler, you can't get near it it's so hot but with a condensing boiler you can easy put your hand and keep it there.<\/p>\n<p>The minimal age for a non-condensing boiler is 18 years old, it's definitely seen better days and it's costing a fortune to run, most boilers we sell come with a 10 year warranty so as long as you keep it serviced that boiler will be worry free for a minimal of 10 years and if looked after such as getting a strip down service every 5 years you could get 15-20 years out of a good quality one such as the ideal logic max. To keep your boiler serviced please <a href=\"https:\/\/elementisboilerexperts.com\/boiler-service-colchester\/\">click here<\/a><\/p>\n<p>Super quiet, one of the biggest complements we get about installing a new boiler is how quiet it is, compared to the old one which crashed and banged, you have to open to cupboard to check to see if it's even running or not.<\/p>\n<h3>Smart controls such as hive, nest, tado<\/h3>\n<p>Henry asked us to install a hive as part of the installation, this was nice and simple as all of the old electrics had come out and the only wire I needed to reuse was for the boiler. The new cylinder is what we call a pre plumbed so all the wiring was pre connected into the wiring centre so all that was required from me was a 3 core wire into the wiring centre, 5 core into the hive receiver and then connect the receiver to the cylinder controls, I wish every job was this simple!<\/p>\n<p>Control from the programmer (customer decided to put this onto a stand to keep it mobile) or control from your phone, you can have multiple users but no arguing now, we can help with your heating and hot water needs but domestic arguments is not our forte.<\/p>\n<p>Having the benefit of internet control, a nice bright easy to read display and the fact a smart control will talk efficiently to your new boiler it's a win win and a great investment.<\/p>\n<p><img decoding=\"async\" class=\"alignnone size-laptop-1200 wp-image-1333\" src=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/unvented-cylinder-1024x1365.jpg\" alt=\"unvented cylinder\" width=\"1024\" height=\"1365\" srcset=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/unvented-cylinder-1024x1365.jpg 1024w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/unvented-cylinder-480x640.jpg 480w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/unvented-cylinder-992x1323.jpg 992w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2023\/11\/unvented-cylinder.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>To book a quote please visit <a href=\"https:\/\/elementisboilerexperts.com\/new-boiler-colchester\/\">get quote<\/a><\/p>\n<p>Or call our office on 01206 912068<\/p>\n<p>Email info@elementisboilerexperts.com<\/p>\n<h3><\/h3>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We were contacted by Henry in Wivenhoe regarding changing his old non condensing boiler and his boiler mate 2000 system. Apparently his boiler mate was the last one left on the estate as every other one had leaked through the ceiling, something that had happened here but had been repaired in the past. So what [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1333,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","footnotes":""},"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/1328"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=1328"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/1328\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/1333"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=1328"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=1328"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=1328"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}