{"id":318,"date":"2022-08-24T17:53:01","date_gmt":"2022-08-24T16:53:01","guid":{"rendered":"https:\/\/new.elementisboilerexperts.com\/?p=318"},"modified":"2022-11-16T16:00:19","modified_gmt":"2022-11-16T16:00:19","slug":"boiler-making-noise-5-possible-causes","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/advice\/boiler-making-noise-5-possible-causes\/","title":{"rendered":"Boiler Making Noise? 5 Possible Causes"},"content":{"rendered":"<h3>Your boiler is the silent hero of your home, providing warmth to every room without even catching your attention. Or, that’s usually the case... Unfortunately, when things go wrong and you have a boiler making noise, it’s another story entirely.<\/h3>\n<p>Along with the disruptive noise, you might worry about what the issue could be – and how much it will cost to fix it. In this post, we’ll cover some possible causes, along with solutions.<\/p>\n<h2>Some boiler noises and their potential causes...<\/h2>\n<p>If your boiler is making noise, there are many possible causes. Here are a few common issues...<\/p>\n<h3>Kettling - Boiler whistling noise<\/h3>\n<p>If you hear your boiler whistling, this is most likely caused by either air trapped in your system or “kettling”. The first scenario can be resolved relatively easily, by either you or an engineer bleeding air out of the radiators.<\/p>\n<p>The second is a bit more tricky. “Kettling” is named after the noise it makes, similar to a whistling kettle. It’s caused by a build-up of limescale or debris in the heat exchanger, which restricts the flow of water through the system. This makes the water overheat and turn to steam, leading to the sound of the boiler whistling.<\/p>\n<p>Limescale build-up occurs naturally, especially in hard water areas. Generally speaking, the issue will need to be looked at and resolved by a trained engineer.<\/p>\n<h3>Faulty boiler pump - Aeroplane noise<\/h3>\n<p>Does your boiler sound like Gatwick airport? If your boiler is making a noise like an aeroplane, this is usually a sign that there’s something wrong with your boiler pump. In this scenario, you’d need to bring in a qualified boiler engineer to replace the pump.<\/p>\n<h3>Trapped air - Running water noise<\/h3>\n<p>If your boiler sounds like running water or gurgling water, this is usually a surefire sign of air trapped in the system. This can cause further complications, preventing heat from travelling freely around your home. Again, the best solution here would be to drain your radiators or to employ a professional boiler engineer to resolve it for you.<\/p>\n<h3>Faulty parts (and more kettling!) - Banging noise<\/h3>\n<p>A boiler making a banging noise can also be caused by kettling. As well as limescale build-up, kettling can also be caused by faulty parts. For example, a faulty thermostat could give a wrong temperature reading, leading to the water over-heating. This is especially a risk for older models, so upgrading to a <a href=\"https:\/\/elementisboilerexperts.com\/new-boiler\/\">new boiler<\/a> with up-to-date safety features is often the best option.<\/p>\n<h3>Faulty fan or pump - Humming, vibrating or grinding noises<\/h3>\n<p>If your boiler is making a noise of this kind, it’s most likely a boiler pump related issue. It could be that the pump is faulty, leading to low pressure and overheating. It might also be set too high, so that water is travelling too fast through the system.<\/p>\n<p>On the other hand, a consistent humming noise could be caused by faulty bearings in your boiler fan.<\/p>\n<p>With both these scenarios, it’s recommended to get an expert in to help you resolve the issue. If you’re concerned about a faulty pump, it’s also important to switch off the system to remove the risk of overheating.<\/p>\n<h2>Resolve boiler issues with Elementis<\/h2>\n<p>Boilers can make some unusual noises, but it doesn’t immediately suggest anything dangerous. Ultimately, however, you should consult an expert <a href=\"https:\/\/elementisboilerexperts.com\/heating-engineer\/\">boiler engineer<\/a> at the nearest opportunity.<\/p>\n<p>At Elementis, we have vast experience of installing, repairing and servicing boilers across the Essex area. If you have a boiler making noises that you’re concerned about, <a href=\"https:\/\/elementisboilerexperts.com\/contact-us\/\">get in touch<\/a> with our friendly team. Alternatively, request a free quote today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your boiler is the silent hero of your home, providing warmth to every room without even catching your attention. Or, that’s usually the case... Unfortunately, when things go wrong and you have a boiler making noise, it’s another story entirely. Along with the disruptive noise, you might worry about what the issue could be – [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":320,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"Boiler Making Noise? 5 Possible Causes","_seopress_titles_desc":"Find out more about the common noises boilers make, what noises are cause for concern and solutions for boiler problems. Get expert advice &gt;&gt;","_seopress_robots_index":"","footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/318"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=318"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/318\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/320"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=318"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=318"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=318"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}