{"id":650,"date":"2022-11-27T15:28:39","date_gmt":"2022-11-27T15:28:39","guid":{"rendered":"https:\/\/elementisboilerexperts.com\/?p=650"},"modified":"2022-12-12T18:45:12","modified_gmt":"2022-12-12T18:45:12","slug":"how-to-choose-a-boiler-installation-company","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/advice\/how-to-choose-a-boiler-installation-company\/","title":{"rendered":"How to Choose a Boiler Installation Company?"},"content":{"rendered":"<p>For most homeowners, choosing a new boiler installation company tends to be a rushed decision; usually the first sign that the boiler needs attention is when it fails. We want to get the problem fixed – and our houses warm – as soon as possible, so we end up choosing a company based on who can carry it out soonest, without taking other important factors into account.<\/p>\n<p>But this is an important decision to make; a badly installed boiler will not only run inefficiently – impacting both your house’s warmth and your wallet – but can also be dangerous.<\/p>\n<p>If you, like many homeowners, want to choose a reliable company but you’re not sure where to start, we’re here to make the task a little less overwhelming.<\/p>\n<p>Here’s our guide to choosing your new boiler installation company.<\/p>\n<h2>What to look out for when choosing a gas safe registered boiler installation company?<\/h2>\n<p>First off, here’s our checklist of primary requirements that your new boiler installation company must have. If they can’t show you evidence of these things, you shouldn’t employ them.<\/p>\n<h3>1. Are they Gas Safe Registered?<\/h3>\n<p>This means they’re certified to have relevant competencies in gas, electricity, and water appliances. Ask to see their Gas Safe ID card, which will show a list of skills the engineer is qualified in. You can verify their license number on the <a href=\"https:\/\/www.gassaferegister.co.uk\/find-an-engineer-or-check-the-register\/\" target=\"_blank\" rel=\"noopener\">Gas Safe Register website<\/a> to check they’re registered.<\/p>\n<h3>2. Do they have public liability insurance?<\/h3>\n<p>Ask for proof of their public liability insurance. This means that if the company causes damage to your property, the cost will fall on them rather than you as the homeowner.<\/p>\n<h3>3. Can they provide a CP12 certificate?<\/h3>\n<p>A CP12 gas safety certificate is a legal document confirming the safety of gas appliances within a property. These are usually only required by landlords, so you may not need one yourself, but as they can only be provided by qualified gas safe installers, asking whether your engineer could provide one is a good way to check their credentials.<\/p>\n<h3>4. Do they have a company address and active telephone number?<\/h3>\n<p>You can usually find these on the company’s website. If they are missing or don’t appear to be up to date, you’ve found a company to avoid.<\/p>\n<h2>Narrowing it down<\/h2>\n<p>So, you know the basic requirements that your new boiler installation company must have. But how do you find the best one to meet your needs?<\/p>\n<h3>Local vs. national boiler companies<\/h3>\n<p>It’s good to bear in mind that there are strengths and weaknesses to employing a local or a national company to install your boiler.<\/p>\n<p>National companies are much larger, and often have a credible reputation. As they have many more employees, they may well have more staff available. However, you will pay much higher prices to employ a national company than a local one.<\/p>\n<p>You may need to do a bit more research to work out their trustworthiness, but compared to those of a large national organisation, the reviews that you read online for a smaller local company are likely to be much more representative of customer experience; all of their customers will be reviewing the same small team of people.<\/p>\n<p>You’ll usually pay less for the services of a local company and be able to build a good relationship with them too. You’re much more likely to quickly be able to talk to a real person about your boiler problems rather than waiting in a call queue, and your local company will be able to provide a much more consistent service, as they can send the same engineer out whenever you need them. They’ll be able to get to know you and your boiler, rather than you having to get a different staff member up to speed with each visit.<\/p>\n<h3>Get recommendations and read reviews<\/h3>\n<p>One of the best ways to find a trusted and reliable new boiler installation company is through recommendations. Whether you ask your friends and family or simply read reviews online, a company’s previous customers will be able to report on the quality of service and customer support they really provide. The company itself should also be willing to provide references from their previous customers – if they seem reluctant to do so, steer clear.<\/p>\n<p>You may want to ask for recommendations from other tradespeople who you trust – for example if you’ve used a reliable electrician before, you could see whether they have a heating engineer who they work with and would recommend.<\/p>\n<p>It’s never been easier to find reviews for tradespeople – a simple search for the company’s name should bring up <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/www.google.com\/\" target=\"_blank\" rel=\"noopener\">Google<\/a><\/span> and <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/www.facebook.com\/\" target=\"_blank\" rel=\"noopener\">Facebook<\/a><\/span> reviews from previous customers. Using a website like <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/www.checkatrade.com\/\" target=\"_blank\" rel=\"noopener\">CheckaTrade<\/a><\/span> will also help you to establish a company’s credentials away from the potential dangers of spurious reviews online.<\/p>\n<h3>What to look for?<\/h3>\n<p>As well as reading plenty of reviews, spend some good time on the company’s website to establish the feel of the company and what they’re able to achieve. If they provide information and advice about boilers in general, that’s a good sign – this shows that they know their stuff. Here are our top tips for what else to look for on their website:<\/p>\n<h5>How long have they been running?<\/h5>\n<p>Unless they’ve been getting bad reviews for years, the longer the company has been in operation, the better – they’ve built up years of expertise and trust.<\/p>\n<h5>Do they prioritise customer care?<\/h5>\n<p>Do they seem approachable, and keen to provide good support to their customers both during and after the installation? Again, reviews and references from previous customers will help you to gauge this.<\/p>\n<h5>Do they have a manufacturer preference?<\/h5>\n<p>Many smaller boiler installation companies will have a specialism in a small number of particular boiler manufacturers. This is a real advantage, as it means that they will be able to provide good support for customers using those boilers, and their expertise will save you money on both parts and labour time.<\/p>\n<h3>Get in touch with a few companies<\/h3>\n<p>As we also advise in our article, <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/elementisboilerexperts.com\/new-boiler-buying-guide\/\">‘Boiler Quotes – A Complete Guide’<\/a><\/span>, when looking for a new boiler installation company you should get quotes from a few companies in writing. These should be itemised so that you can see what they’re charging for parts and labour. Before they quote, they should arrange to meet you at the house to assess the situation; if a company would rather give a quote without seeing your property in person, this is one to avoid – they should be as well-informed as possible before giving you a firm price.<\/p>\n<p>Some companies will give you an online estimate once you have answered a few questions on their website. However, they should then still arrange a visit to your property before giving you a final quote.<\/p>\n<p>When the company to arrange a visit, make sure you’re prepared to meet them. Write a list of questions that you’d like answers to, and gauge their responses – are they polite and well-informed? Are they willing to answer your queries, and can they explain the issues in a way that you understand? If they seem shifty or reluctant to answer your questions, this is a bad sign.<\/p>\n<p>It's not uncommon for companies to ask for an up-front payment on larger jobs. Occasionally an installer may ask for up to half the overall price to be paid before work begins, but if they ask for the full amount to be paid up-front this is a red flag. Find another company to use instead of them.<\/p>\n<p>Both on the phone and in person, aim to establish whether their staff are approachable and friendly. If you choose to employ them, they will be in your house, and you must feel comfortable around them. Do they put you at ease? Do they listen to your concerns? Would you be happy for them to continue to provide assistance with your boiler into the future?<\/p>\n<h3>Deciding on your new boiler installation company<\/h3>\n<p>Once you’ve had quotes from at least three companies, you’ll be ready to choose between them. Remember, you’re not just basing your decision on who has quoted the cheapest price, but who is providing the best value for money – you’re paying for good quality service, both during and after the installation.<\/p>\n<p>Make sure you understand what it is that the engineer plans to do and that they have explained this clearly to you. Ask them about the guarantee on their services so that you know that you can ask them for remedial work if anything goes wrong. Research the boiler that they are recommending and ask questions if you feel it may not be suitable for your needs. Check the service warranty on the boiler before you agree to anything; this is how long your boiler is covered by the manufacturer should anything go wrong.<\/p>\n<p>Once you’ve found a company who you trust, and whose services you believe are right for your household, you’ve found your new boiler installation company – it’s time to arrange for them to start the job.<\/p>\n<h4>How can Elementis Boiler Experts help?<\/h4>\n<p>If you’d like a quote from an experienced local installer in Colchester and the surrounding areas, <a href=\"https:\/\/elementisboilerexperts.com\/new-boiler\/\">please do get in touch<\/a>. We’d love to help you to make the best decision on your heating system and be the new boiler installation company who are best for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For most homeowners, choosing a new boiler installation company tends to be a rushed decision; usually the first sign that the boiler needs attention is when it fails. We want to get the problem fixed – and our houses warm – as soon as possible, so we end up choosing a company based on who [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":654,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/650"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=650"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/650\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/654"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=650"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=650"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=650"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}