{"id":1102,"date":"2023-06-23T05:35:24","date_gmt":"2023-06-23T04:35:24","guid":{"rendered":"https:\/\/elementisboilerexperts.com\/?p=1102"},"modified":"2023-06-23T05:35:24","modified_gmt":"2023-06-23T04:35:24","slug":"cheaper-doesnt-mean-value-when-choosing-a-boiler-company","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/advice\/cheaper-doesnt-mean-value-when-choosing-a-boiler-company\/","title":{"rendered":"Cheaper doesn't mean value when choosing a boiler company"},"content":{"rendered":"<p>So we've recently been contacted from an existing customer about her 1 year old boiler. We've been asked to service the boiler and sort out all the issues in the system left by another heating company. So a little back story to this, we quoted against another heating company this time last year and unfortunately the other company won the quote. Like any job we don't win (can't win them all right) we call the customer to ask why they didn't get their heating work done by us so we can improve our service and offer in the future. We were told we were great but it just came down to cost as the other company were cheaper, fair enough some people are on tight budgets and go with their second or third choice purely based on cost but the point of this post is low cost doesn't always equate to value for money.<\/p>\n<h2>A little was saved but more was lost on the heating upgrade<\/h2>\n<p>Sometimes (more than times than not) it's best to pay a little more to get a company that has a great reputation because now the customer has asked us to go back to put right the cheaper companies wrongs because they're refusing to answer the phone and the website is down which makes us think the company has now gone bust. So even tho a little was saved at the beginning over all it will probably cost more than going with us to begin with. There's always someone out there that will take cash or ask the customer to buy the materials so they can stay under the vat threshold, this screams unprofessional to me and you have no real guarantee with the installation. We never take cash, we pay all our taxes such as vat, corporation tax, personal tax and at times it feels we're being screwed by the government but firstly I live my live with integrity and so naturally my business is a copy of me and secondly I like to sleep at night knowing i'm not a letter away from legal battle with HMRC because i've avoided tax, trust me we pay <em>TOO<\/em> much.<\/p>\n<h2>Why our existing customers rarely shop on price when buying a replacement boiler<\/h2>\n<p>We use a few different sites to get our boiler leads but none are better than our existing customers because they know how we operate, they know if there was ever an issue with something we've done we would be back around in an instant to sort it (it's life, not everything is perfect 100% of the time but it's how you react is what's important) and they won't waste their time shopping around for the cheapest as they understand they already have the best and when on the rare occasion they have gone with someone else like this job it's come back to bite them. Looking back they probably wish they went with us to begin with but they didn't and I could get on my high horse and say \"well we don't like putting other peoples work right after you chose them over us\" but you know what I like the customer and it was a genuine reason to go with them but as it's proved cheap doesn't always mean value.<\/p>\n<h3>How to book a boiler quote in person or a online instant boiler quote<\/h3>\n<p>If you're interested in using a company that's here for the long run (not like 5 minutes Joe above who has probably installed many heating systems incorrectly but isn't around anymore to put it right) please call us on 01206 912068 or <\/p>\n<p>To get an instant online quote <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/elementisboilerexperts.com\/new-boiler\/\">visit here<\/a><\/span><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So we've recently been contacted from an existing customer about her 1 year old boiler. We've been asked to service the boiler and sort out all the issues in the system left by another heating company. So a little back story to this, we quoted against another heating company this time last year and unfortunately [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1105,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"Cheaper doesn&#039;t mean value when choosing a boiler company","_seopress_titles_desc":"","_seopress_robots_index":"","footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/1102"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=1102"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/1102\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/1105"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=1102"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=1102"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=1102"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}