{"id":511,"date":"2022-10-06T08:04:57","date_gmt":"2022-10-06T07:04:57","guid":{"rendered":"https:\/\/elementisboilerexperts.com\/?p=511"},"modified":"2022-11-16T16:01:57","modified_gmt":"2022-11-16T16:01:57","slug":"should-i-consider-a-combi-boiler","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/advice\/should-i-consider-a-combi-boiler\/","title":{"rendered":"Should I Consider a Combi Boiler?"},"content":{"rendered":"<p><img decoding=\"async\" class=\"alignnone size-full wp-image-513\" src=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/10\/Colchester-combi-boiler.jpeg\" alt=\"colchester combi boiler\" width=\"992\" height=\"1323\" srcset=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/10\/Colchester-combi-boiler.jpeg 992w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/10\/Colchester-combi-boiler-480x640.jpeg 480w\" sizes=\"(max-width: 992px) 100vw, 992px\" \/><\/p>\n<h2>There are lot's of things worth considering when converting your old system to a combi boiler.<\/h2>\n<h3>Let's start with the Pros of having a combi boiler<\/h3>\n<p>So the best things about a combi boiler are, they save ALOT of space. By converting to a combi boiler you remove the old cylinder from the airing cupboard and presuming the tanks in the loft are not asbestos they can be removed. Some people miss the heat given off by a cylinder (this is wasted heat which is being lost all day, every day) we can install a small 450 x 450 radiator that will come on with the rest of the heating giving you them all important warm towels.<\/p>\n<p>Another great thing about a combi boiler is high pressured water, this is because and presuming your incoming mains pressure is adequate (don't worry we test this) your combi boiler will heat the water instantly, there's no limit on how much water you use as the boiler will just keep heating as much water as required, this has a benefit over cylinders in the fact they have a set amount of water which has the potential to run out.<\/p>\n<p>They can be used with efficient gas saving technology such as open therm and weather compensation. So let's start with opentherm, this technology communicates from the programmer to the boiler, instead of a normal programmer where it tells the boiler to come on or off there is no real modulation in the gas supply, with opentherm it can tell the boiler when the house is nearing is desired temperature and the opentherm technology will tell the boiler to start ramping down the gas supply and \"simmer\", this not only makes the boiler condense for longer but stops the boiler starting and stopping all the time saving gas and the longevity of the components.<\/p>\n<p>Weather compensation works by installing a probe outside that detects the temperature and modulates the gas valve and fan to burn lower when weather is mild or harder when it's cold. Out of the two opentherm is the most popular as it's simple to install with programmers such as Ideal Halo that plugs into the boiler and has a standalone unit so you can either control from your smart phone or the unit itself.<\/p>\n<h4>So a breakdown of the pros of having a combi boiler;<\/h4>\n<p>♦ They save ALOT of space compared to a traditional boiler and cylinder.<\/p>\n<p>♦ They only heat the water you need meaning no water sitting in a cylinder losing heat all day long.<\/p>\n<p>♦ Infinite hot water, you will not run out of hot water like in a traditional hotwater system.<\/p>\n<p>♦ Works with energy saving technology such as weather compensation and opentherm.<\/p>\n<p><img decoding=\"async\" class=\"alignnone size-full wp-image-517\" src=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/10\/Combi-boiler-Witham.jpg\" alt=\"combi boiler witham\" width=\"992\" height=\"1323\" srcset=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/10\/Combi-boiler-Witham.jpg 992w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/10\/Combi-boiler-Witham-480x640.jpg 480w\" sizes=\"(max-width: 992px) 100vw, 992px\" \/><\/p>\n<h2>Here are the cons of having a combination boiler.<\/h2>\n<p>You do not have any back up hotwater if you were unlucky enough for your boiler to breakdown, this is one of the reasons we promote 10 and 12 year warranty and also ideal boilers, we install a lot of ideal combi boilers so if you were unlucky for your combi boiler to breakdown they look after me and my customers and get a repair done very quickly. They're ultra reliable so it's very rare for an ideal boiler to breakdown before 10 years if serviced correctly by a company such as Elementis Boiler Experts who do not cut corners when servicing.<\/p>\n<p>That being said the best combination is having a combi boiler with an electric shower installed, this would give you another heat source of hotwater if you were unlucky and your boiler did break down.<\/p>\n<p>During installation there is a lot more work and pipework involved than just changing a like for like boiler so naturally it's more expensive to convert a gravity system to a pressurised. But.. the savings on gas usage will soon pay for itself so this is definitely an investment for the future. The gas pipework is calculated and will more than likely need upgrading which may involve a new route externally. We spend alot of time and effort making sure any external pipework is as neat as possible so it just looks like a feature of the house rather than stand out like a sore thumb such as some of the pipework we see on a regular bases.<\/p>\n<p>There is a possibility your incoming mains pressure will not be adequate for a combi boiler so you may require a mains pump or an accumulator to boost your pressure.<\/p>\n<p>Pressure and flow rate are two different things, flow rate is how quickly you can fill a bath and pressure is the force that you feel from a shower. A combi boiler will give you mains\/high pressure so makes for a really great shower experience but will be slower at filling a bath than a gravity system but it does have the benefit of filling multiple baths without the risk of running out of hotwater. If baths are important to you it would be advisable to get a large combi boiler such a ideal logic max 35kw.<\/p>\n<h4>Here is a breakdown of the cons;<\/h4>\n<p>♦ If your combi boiler was to break down you wouldn't have a back up of hotwater unless you had an electric shower.<\/p>\n<p>♦ Initial installation cost is higher than a straight swap boiler.<\/p>\n<p>♦ Possibly need a mains pump or accumulator.<\/p>\n<p>♦ Not as much flow rate as a traditional gravity system.<\/p>\n<p>As with any type of system they have their pros and cons but if it's money on your gas bill you're looking to save on you cannot do better than a combi boiler, the initial upgrade cost pays for itself in no time so if you have a small family with a maximum of 2 bathrooms they really are a great option! If you would like to find out more about a combi boiler installation in Colchester and surrounding areas please book a quote at <a href=\"https:\/\/elementisboilerexperts.com\/new-boiler\/\">https:\/\/elementisboilerexperts.com\/new-boiler\/<\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are lot's of things worth considering when converting your old system to a combi boiler. Let's start with the Pros of having a combi boiler So the best things about a combi boiler are, they save ALOT of space. By converting to a combi boiler you remove the old cylinder from the airing cupboard [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":514,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"Combi Boiler Local to Colchester | Elementis Boilers","_seopress_titles_desc":"The Pros and Cons of a Combi Boiler in Colchester, Braintree, Sudbury, Witham, Mersea | Elementis Boiler Experts LTD | No1 Local Heating Company","_seopress_robots_index":"","footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/511"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=511"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/511\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/514"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=511"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=511"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=511"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}