{"id":620,"date":"2022-11-18T06:16:19","date_gmt":"2022-11-18T06:16:19","guid":{"rendered":"https:\/\/elementisboilerexperts.com\/?p=620"},"modified":"2023-08-03T11:54:17","modified_gmt":"2023-08-03T10:54:17","slug":"how-to-spot-a-boiler-leak","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/advice\/how-to-spot-a-boiler-leak\/","title":{"rendered":"How to Spot a Boiler Leak"},"content":{"rendered":"<p>If you’ve noticed that your heating system is running a little differently to how it used to and wondering why, perhaps you need to investigate whether you may have a boiler leak. These often occur in the wintertime, when heating systems are used more and there is a higher chance of frost damage to pipes. There are plenty of tell-tale signs to help you spot a boiler leak, and we hope that this guide will help you to identify the issues at hand.<\/p>\n<h2><\/h2>\n<h2>Gas leaks<\/h2>\n<p>This article is primarily about how to spot a water leak in your boiler system; if you are worried that you may have a gas leak, you should call the National Gas Emergency Service immediately on 0800 111 999. If you can smell gas, hear hissing sounds in your home, your gas usage seems much higher than normal or you feel persistently light-headed, nauseous, or suffer from headaches, you may have a gas leak and need to investigate this urgently. The National Gas Emergency Service will help you to work out what to do about a gas leak free of charge.<\/p>\n<h2>Water leaks<\/h2>\n<p>Boiler leaks often occur when water escapes from the system. Your gas boiler heats your house by heating up water inside the boiler, which runs through pipes to your radiators or underfloor heating system, transferring the heat to your home. When the water in the system leaks, the pressure will drop and your heating system will not run as efficiently - and may eventually stop working altogether. There can also be damage caused to the boiler and to your house.<\/p>\n<p>It may be that there is a leak in the pipework around your house, which connects to the radiators or underfloor heating pipes. You can find these by looking for water in these areas, especially around radiator valves, or rust spots on radiators. In this article we are going to look at how you can identify boiler leaks specifically, rather than those in the heating system elsewhere in your home.<\/p>\n<h3>Why do boiler leaks occur?<\/h3>\n<p>The reasons for leaks are quite varied. One of the components of your heating system may not have been sealed properly, for example the joints where your pipes meet the boiler, or on older boilers some parts may simply have stopped working properly due to wear and tear. The heat exchanger, where the cold water in your system is heated before being sent through the pipes around the house, is one component which often becomes damaged and may cause leaks.<\/p>\n<p>It may also be that the pressure relief valve in your system – which works by allowing fluid to leave the system safely when the pressure becomes too high – is releasing too much pressure, thereby allowing extra liquid to leave the system.<\/p>\n<h4>How do you know if you have a boiler leak?<\/h4>\n<p>Many homeowners become aware of boiler leaks when they notice an obvious sign, such as dripping or running water coming from or around the boiler. If you’ve noticed this, it may be useful to place a non-white t-shirt or a piece of coloured paper under your boiler, so that you can see where exactly the drops come from when they fall from the boiler; this could help you to identify the exact cause of the issue.<\/p>\n<p>However, you may suspect you have a boiler leak without having seen any water around the boiler. If yours is a sealed system, you may have noticed your heating system cutting out due to low pressure and losing pressure quickly even after topping it up. This is a tell-tale sign of a leak in your system. If your system uses a make-up tank, the system won’t cut out due to pressure loss, but you can still look out for visible signs of a leak.<\/p>\n<p>There may well be physical signs of a leak whether your system is sealed or not; look out for water running down the wall behind the boiler, or an excess volume of water may be seen running through the condensate pipe (the pipe which carries condensate through an external wall near the boiler). You may find mould and damp near the boiler, and evidence of water on materials near the boiler, such as warped windowsills or skirting boards. If you take care to avoid touching any hot pipes you can also check the boiler itself for water damage, such as rust.<\/p>\n<p>Whilst you’re checking the boiler and the area around it, listen out for kettling noises, which may be a sign of a build-up of limescale or excessive flame impingement around the heat exchanger; this could be causing your leakage issue. Read our blog about other issues which may be causing your boiler to make a noise.<\/p>\n<h3>What do I do if I have a boiler leak?<\/h3>\n<p>Again, it is important that if you suspect you have a gas leak, you ring the National Gas Emergency Service immediately on 0800 111 999. In this article we are focused more on what to do when faced with a water leak.<\/p>\n<p>There are a few things that you can do to identify the root of the leak and try to combat it. First of all, turn off the electricity supply to the boiler to reduce the risk of electric shock, and damage to the heating system while you’re troubleshooting.<\/p>\n<p>It’s a good idea to check the pressure gauge for the heating system. If it’s registering at the high end of the red zone, water may be escaping from the pressure relief valve, as it is designed to allow this to happen.<\/p>\n<p>You can also check that the filling loop – which connects the boiler to the mains water supply to allow new water in when repressurising – isn’t stuck in the open position. This would be continually allowing more water into the system, increasing the pressure. When you’ve ensured that the filling loop is closed, make sure that the heating system is cool, and bleed your radiators to release boiler pressure.<\/p>\n<p>Once the system is switched back on, check to see if the water is still leaking. If it is, or if the pressure gauge rises into the red again once your boiler is up and running, it’s time to arrange a boiler repair. We’d love to help you identify the cause of your boiler leak and advise you on the best next steps; please contact us on <a href=\"tel:01206912068\">01206 912068<\/a> to discuss this further or <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/elementisboilerexperts.com\/boiler-repair\/\">to book a boiler repair click here<\/a><\/span><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’ve noticed that your heating system is running a little differently to how it used to and wondering why, perhaps you need to investigate whether you may have a boiler leak. These often occur in the wintertime, when heating systems are used more and there is a higher chance of frost damage to pipes. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":622,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"How to spot a boiler leak | Elementis Boiler Experts","_seopress_titles_desc":"Think you may have a leak on your boiler? Left untreated without a repair a replacement boiler maybe required because of damage.","_seopress_robots_index":"","footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/620"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=620"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/620\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/622"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=620"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=620"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=620"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}