{"id":674,"date":"2022-12-05T06:04:13","date_gmt":"2022-12-05T06:04:13","guid":{"rendered":"https:\/\/elementisboilerexperts.com\/?p=674"},"modified":"2023-08-17T04:52:51","modified_gmt":"2023-08-17T03:52:51","slug":"ashley-page-colchester","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/case-studies\/ashley-page-colchester\/","title":{"rendered":"Ashley Page - Colchester"},"content":{"rendered":"<h2><img decoding=\"async\" class=\"alignnone size-full wp-image-612\" src=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/11\/heat-only-boiler.jpg\" alt=\"heat only boiler\" width=\"900\" height=\"1200\" srcset=\"https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/11\/heat-only-boiler.jpg 900w, https:\/\/elementisboilerexperts.com\/wp-content\/uploads\/2022\/11\/heat-only-boiler-480x640.jpg 480w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/h2>\n<h2 class=\"p1\">A well needed upgrade from a gas guzzling back boiler with pilot light to an energy efficient ideal logic heat only boiler<\/h2>\n<p class=\"p2\">We visited Ashley Page in Colchester because he wanted to lower his rising gas bills and wanted to install a wood burner in place of the back boiler. The old back boiler that was at the property was well over 30 years old. The problem with such boilers is they cost an absolute fortune to run, proof of this is testing the flue temperature, it will be in excess of 160 oC where as a new boiler it will be around the 60 oC mark. The reason is old boilers like this are non-condensing, if your boiler is around 18 years old plus and doesn't have a white 22mm pipe coming from it will be a non condensing type.<\/p>\n<p class=\"p2\">One other main reason to upgrade is most parts for these old boilers are obsolete so if you were very unlucky and it broke down during the winter you will probably need to have it replaced, this would be a much better idea to do in the summer because it could be a planned repair and not having to wait days for a new installation at peak time.<\/p>\n<p class=\"p2\">The reason condensing boilers are much more efficient is because they reuse the flue gases to heat the return water coming back to the boiler, otherwise this is just wasted heat. All boilers sold in the UK now have to be of the condensing kind.<\/p>\n<p class=\"p2\">When removing old back boilers we offer to remove the whole unit or leave just the front fire working if possible. On this occasion we disconnected all of the pipework because the customer wanted to use a solid fuel burner in the future, in this case we left the fire in place until time was right to purchase the solid fuel burner.<\/p>\n<h3 class=\"p1\">What was the equipment that we installed for the boiler installation?<\/h3>\n<p class=\"p2\">We decided to install the ideal logic MAX Heat only 18KW boiler with a 10 year warranty. The customer wanted to relocate the boiler into the loft, this is fine but it causes one issue, the header tank that fills the heating system is located in the loft (on most occasions) and this uses gravity. The boiler cannot be at the same height or only slight higher as you will get air locks. There is two ways around this, raise the header tank so it has more head height\/pressure, this is never perfect so we opted to convert the heating to a pressurised system.<\/p>\n<p class=\"p2\">We did this by bringing a mains water pipe up to the boiler and installed an expansion vessel next to the boiler. When doing this type of system in a loft we ALWAYS bring pipework back down to the airing cupboard with a filling loop and pressure gauge so if the system ever needed topping up it can be done without climbing into a loft.<\/p>\n<h2 class=\"p1\">The re run of the gas pipework for the central heating<\/h2>\n<h3 class=\"p1\">The thought process for the gas run<\/h3>\n<p class=\"p2\">We had to run new 22mm gas pipework from the front of the house around to the side and up into the roof space. This took quite a bit of planning as we figured out the most economical run but also being pleasing on the eye. We calculated the size of the pipework over the distance required.<\/p>\n<h3 class=\"p4\">Installing the gas boiler into the loft space<\/h3>\n<p class=\"p2\">Compared the old back boiler which used a chimney stack to remove it's products of combustion and pulled fresh air from the room, this the reason rooms where the back boiler is located are quite cold as they need to have a constant flow of fresh air from a vent to outside for it to run safely.<\/p>\n<p class=\"p2\">The great thing about modern boilers is the flue has two parts, the outside part which pulls fresh in and outside part which blows out the products of combustion. These are called room sealed boilers and even if the boiler had produced a fault and was burning un safe the products of combustion would always go outside not causing any harm to the household. The way to tell from outside would be a very gassy mix of condensate which would be easy to smell. If you think this could be an issue with your current boiler please get it investigated by booking a boiler repair at  <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/elementisboilerexperts.com\/boiler-repair\/\"><span class=\"s1\">https:\/\/elementisboilerexperts.com\/boiler-repair\/<\/span><\/a><\/span><\/p>\n<h3 class=\"p1\">The installation of the new boiler<\/h3>\n<p class=\"p2\">As you can see, even tho this pipework will be covered with lagging we still try and install it as neatly as possible. We have installed two automatic air vents as air will naturally rise, at the top of the boiler will be a prime place for air to get trapped causing air locks. This is also another really important reason we install a filling loop in the airing cupboard because normally for the first couple weeks bits of trapped air that are impossible to remove at first will always find their way to the highest point in the central heating system which in this case is the loft space. The automatic air valves will open to allow the air out and keep the water in but will drop the pressure meaning it will need topping up, this usually settles in a day or two but may take a couple weeks.<\/p>\n<p class=\"p2\">If you would like to get a new boiler quote please visit our free boiler quote survey at <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/elementisboilerexperts.com\/new-boiler\/\">https:\/\/elementisboilerexperts.com\/new-boiler\/<\/a><\/span><\/p>\n<h3 class=\"p2\">The finished boiler in Colchester<\/h3>\n<p class=\"p2\">Here you can see all of the pipework is neatly lagged to protect from frost. We commissioned the boiler and registered the warranty with ideal boilers. We then registered the installation with gas safe register, make sure when you get your boiler installed or anything gas related please check your engineers gas safe card to check online to see if they are legitimate as there are illegal engineers out there so be careful.<\/p>\n<p class=\"p2\">We explained how the boiler works, where and how to use the filling loop located in the airing cupboard. We removed all rubbish from site and left everything as clean as it was before we got there.<\/p>\n<p class=\"p2\">The customer was impressed with our booking system where the boiler quote was booked via our link <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/elementisboilerexperts.com\/new-boiler-buying-guide\/\"><span class=\"s1\">https:\/\/elementisboilerexperts.com\/boiler-installation\/<\/span><\/a><\/span> where a date and time was selected by the client.<\/p>\n<p class=\"p2\">Then a confirmation text and email was sent out that the date and time selected was in the diary. 24 hours before the appointment a reminder is sent out that we will be with you tomorrow.<\/p>\n<p class=\"p2\">On the day of the appointment we will notify you when we leave the previous job with an exact arrival time, we give a rough time on the confirmation but as with the nature of the beast some jobs over run but we will always message to let you know the engineer is running late.<\/p>\n<p class=\"p2\">You can then track the van on the way to your house once we notify you we have left the previous job.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A well needed upgrade from a gas guzzling back boiler with pilot light to an energy efficient ideal logic heat only boiler We visited Ashley Page in Colchester because he wanted to lower his rising gas bills and wanted to install a wood burner in place of the back boiler. The old back boiler that [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":609,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","footnotes":""},"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/674"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=674"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/674\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/609"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=674"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=674"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=674"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}