{"id":706,"date":"2022-12-13T06:55:58","date_gmt":"2022-12-13T06:55:58","guid":{"rendered":"https:\/\/elementisboilerexperts.com\/?p=706"},"modified":"2023-06-06T09:23:30","modified_gmt":"2023-06-06T08:23:30","slug":"why-do-i-need-a-new-boiler-survey-before-installation","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/advice\/why-do-i-need-a-new-boiler-survey-before-installation\/","title":{"rendered":"Why Do I Need a New Boiler Survey Before Installation?"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>We live in a fast-paced society where we’ve become used to seeing quick results – next-day delivery and instant downloads have become essentials for many households. But there are some things which are worth taking time to properly consider and choosing the right boiler for your house is one of them; having an unsuitable boiler installed is not only more expensive and less efficient but could put your household in danger. Without an in-person new boiler survey from your specialist heating engineer, it’s hard to know the exact specification of boiler which will be best for your house, and the needs of your household.<\/p>\n<p>&nbsp;<\/p>\n<p>Some companies now offer surveys which are conducted entirely online, where customers fill out an online form or use video footage to assess which boiler they should purchase. We do not recommend this.<\/p>\n<p>&nbsp;<\/p>\n<p>In the same way that most people would expect to view a new house before buying it, it is possible to purchase a property without seeing it, but if you want to be fully informed about whether it meets your needs, it’s best to investigate in-person rather than taking the quick route. For most, it would raise alarm bells if an estate agent were to advise you to buy a house without seeing it, and we believe the same to be true of the need for an in-person survey before purchasing a boiler. The more your engineer knows about your house, your heating and hot water needs, the better informed they will be to advise and install the best boiler for you.<\/p>\n<p>&nbsp;<\/p>\n<h2>What does a new boiler survey involve?<\/h2>\n<p>The aim of a new boiler survey is to assess what type of boiler will be best for your home – so by the end of the visit, the engineer will understand the structure of your home and its current heating system, as well as your household’s energy needs.<\/p>\n<p>A new boiler survey involves a visit to your house by an engineer, who will look around your home so that they can understand and present you with the best options for your new boiler. The engineer will need to access all rooms in the property, including your loft if you have one, and see the gas meter too. This is so that they can fully assess the house, check all pipework and flues to see if they will need replacing, and work out the best positioning for the boiler too.<\/p>\n<p>The engineer will usually ask you a few questions about your house, your heating and hot water requirements, and whether you have any extension or renovation work planned on the property which would need to be accounted for when your new boiler is installed.<\/p>\n<p>After the survey, the engineer will contact you with a quote to provide you with their recommendations for the make and specification of boiler to be installed and how much the project will cost. They should also advise you on the need for any new radiators and pipework, as well as how long the works may take.<\/p>\n<p>&nbsp;<\/p>\n<h2>Why is a new boiler survey important?<\/h2>\n<p>Hopefully having read about what the new boiler survey involves, you now have an idea of why they are so essential, and that an online survey won’t be able to offer the level of assessment that we believe is needed to give an informed recommendation on your new boiler.<\/p>\n<p>As well as the survey being crucial to choosing the boiler which is best suited to your house and its occupants, it’s also an opportunity for you to assess the company which is giving you the quote for installation. When you meet the engineer in person, use it as a chance to see how well-informed they are and how reliable they appear. If they arrive late, don’t want to answer your questions, or don’t take much time and care in assessing your home, we recommend finding another company to install your boiler.<\/p>\n<p>&nbsp;<\/p>\n<p>With an in-person new boiler survey you can also get a measure of how well the company’s outlook matches yours, and whether you are comfortable with their employees. It’s never convenient to have tradespeople working in your home, so you want to know that the people you let in are personable as well as knowledgeable.<\/p>\n<p>&nbsp;<\/p>\n<p>For more information on what to look out for in a boiler company and their employees, take a look at our blog, ‘<span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/elementisboilerexperts.com\/advice\/how-to-choose-a-boiler-installation-company\/\">how to choose a new boiler installation company’.<\/a><\/span><\/p>\n<p>&nbsp;<\/p>\n<h3>How do I prepare for a new boiler survey?<\/h3>\n<p>The main requirement for a new boiler survey is that the current boiler is accessible. This means that someone needs to be home to let the engineer in, and that there is easy access to the boiler, with no furniture or large items blocking the way around it. You don’t need to do a floor-to-ceiling cleanout but do try to ensure that it’s easy for the engineer to do their job.<\/p>\n<p>&nbsp;<\/p>\n<p>Your engineer will usually want to ask a few questions about your heating and hot water needs, and whether you have plans to alter your home in ways which may change the requirements you have of a boiler. Therefore, it’s helpful if the person the engineer meets is able to answer any questions, and is ready to talk about these things. For example, if you are planning an extension and already have plans drawn up, have the plans to hand so that the engineer can assess how much of an increase in boiler size will need to be anticipated.<\/p>\n<p>&nbsp;<\/p>\n<h3>What next?<\/h3>\n<p>Now that you know why it’s so essential to arrange an in-person new boiler survey, Elementis Boiler Experts would love to hear from you if you’re looking for a new boiler in and around Colchester. We know that a boiler installation is not a one-size-fits-all project, and that you don’t want to make any choices which turn out to be expensive mistakes, so we will take the care needed to assess and advise you of your options.<\/p>\n<p>&nbsp;<\/p>\n<p>Please do <span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https:\/\/elementisboilerexperts.com\/contact-us\/\">get in contact<\/a><\/span> with us to arrange your survey and quote – we look forward to hearing from you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We live in a fast-paced society where we’ve become used to seeing quick results – next-day delivery and instant downloads have become essentials for many households. But there are some things which are worth taking time to properly consider and choosing the right boiler for your house is one of them; having an unsuitable [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":709,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"Why I Need a New Boiler Survey Before Installation | Elementis Boilers","_seopress_titles_desc":"","_seopress_robots_index":"","footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/706"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=706"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/706\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/709"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=706"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=706"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=706"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}