{"id":812,"date":"2023-02-17T19:15:01","date_gmt":"2023-02-17T19:15:01","guid":{"rendered":"https:\/\/elementisboilerexperts.com\/?p=812"},"modified":"2023-02-17T19:15:01","modified_gmt":"2023-02-17T19:15:01","slug":"why-are-my-radiators-cold-when-the-heating-is-on","status":"publish","type":"post","link":"https:\/\/elementisboilerexperts.com\/advice\/why-are-my-radiators-cold-when-the-heating-is-on\/","title":{"rendered":"Why Are My Radiators Cold When the Heating is On?"},"content":{"rendered":"<h3>It’s incredibly frustrating when radiators don’t heat up and a room, or your entire house, stays cold. It can be the difference between a warm and cosy night in and a relaxing hot bath – or an evening rounding up hot water bottles and blankets, watching your breath float around the room.<\/h3>\n<p>To save you the experience of shivering in confusion beside your boiler, read on for a few possible reasons as to why your radiators are cold and how they can be fixed.<\/p>\n<h2>1. Why is my radiator cold at the bottom?<\/h2>\n<p>A pretty straightforward problem – if your radiator is cold at the bottom, it is likely due to a blockage. Limescale, sludge, dirt and other bits of debris create a build-up that blocks any heat from that part of the radiator.<\/p>\n<p>Natural minerals in the water create limescale, particularly if you live in an area with ‘hard’ water (water with fewer minerals). Combined with dirt from the heated water in your radiator, this eventually develops into the perfect lump of sludge that needs to be cleared.<\/p>\n<p>To clear the sludge, you can flush out the system yourself or get an expert to do it for you. If it is only one radiator, remove it and use a garden hose or similar and clean the insides out, before refitting. If it is a bigger issue than one radiator, then it’s a good idea to contact a <a href=\"https:\/\/elementisboilerexperts.com\/heating-engineer\/\">professional heating engineer<\/a> to perform a power flush on the whole system, as it can be a messy job.<\/p>\n<h2>2. The downstairs radiators are cold<\/h2>\n<p>When you switch your central heating on, the pump pushes the hot water around the system evenly. If the downstairs radiators are cold, then you are likely to have a balancing issue with your heating.<\/p>\n<p>You may have to either bleed your radiators or <a href=\"https:\/\/www.viessmann.co.uk\/en\/heating-advice\/boilers\/how-to-balance-radiators.html\" target=\"_blank\" rel=\"noopener\">rebalance the system<\/a>. This involves adjusting the valves on your radiators so that the hot water is restricted to the ones that are working well and puts more into the radiators that may need a bit of help.<\/p>\n<h2>3. The heating is on, but one radiator is not working<\/h2>\n<p>One cold radiator could also mean that there is air inside the system. Air gathers at the higher points of the radiator and can prevent the hot water from circulating properly. This is a fairly straightforward problem and can be solved by <a href=\"https:\/\/www.viessmann.co.uk\/en\/heating-advice\/boilers\/how-to-bleed-a-radiator.html\" target=\"_blank\" rel=\"noopener\">‘bleeding’ the radiator<\/a>:<\/p>\n<ul>\n<li>Run the heating at full capacity for 15 mins approx.<\/li>\n<li>Turn your heating off and wait for all radiators to cool (30-60 mins)<\/li>\n<li>Using a bleed key or screwdriver, drain the radiator next to the boiler, until water comes out<\/li>\n<li>Do this for all radiators<\/li>\n<li>Turn on the boiler and check the water pressure<\/li>\n<\/ul>\n<h2>Your go-to heating engineers in Colchester<\/h2>\n<p>Heating problems are one of those house issues that simply can’t wait. You need it fixed ASAP and the best way to do that is to contract an <a href=\"https:\/\/elementisboilerexperts.com\/heating-engineer\/\">experienced heating engineer<\/a>.<\/p>\n<p>Elementis are a professional team of engineers with vast experience in all boiler and heating installations. If you’re wondering why your radiators are cold and you want the problem fixing, contact us on 01206 912068 or use our <a href=\"https:\/\/elementisboilerexperts.com\/contact-us\">online form for a quote<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s incredibly frustrating when radiators don’t heat up and a room, or your entire house, stays cold. It can be the difference between a warm and cosy night in and a relaxing hot bath – or an evening rounding up hot water bottles and blankets, watching your breath float around the room. To save you [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":816,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_seopress_robots_primary_cat":"none","_seopress_titles_title":"Why Are My Radiators Cold When the Heating is On?","_seopress_titles_desc":"Wondering why your radiators are cold? Discover common causes and solutions to fix a radiator that is cold when the heating is on &gt;&gt;","_seopress_robots_index":"","footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/812"}],"collection":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/comments?post=812"}],"version-history":[{"count":0,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/posts\/812\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media\/816"}],"wp:attachment":[{"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/media?parent=812"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/categories?post=812"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/elementisboilerexperts.com\/wp-json\/wp\/v2\/tags?post=812"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}